#!/usr/bin/python

from sklearn import tree

X = [
    [1, '周六', '吃饭', '晴天', '轻松', '清零', '好看'],
    [2, '周日', '吃饭', '阴天', '轻松', '清零', '好看'],
    [3, '周日', '吃饭', '晴天', '轻松', '清零', '好看'],
    [6, '周六', '逛街', '晴天', '轻松', '平缓', '难看'],
    [7, '周日', '逛街', '晴天', '较重', '平缓', '难看'],
    [10, '周六', '学习', '雨天', '轻松', '严峻', '难看'],
    [14, '周间', '逛街', '阴天', '较重', '清零', '好看'],
    [15, '周日', '逛街', '晴天', '轻松', '平缓', '难看'],
    [16, '周间', '吃饭', '晴天', '繁重', '严峻', '好看'],
    [17, '周六', '吃饭', '阴天', '较重', '平缓', '好看'],
]

X_tset = [
    [4, '周六', '吃饭', '阴天', '轻松', '清零', '好看'],
    [5, '周间', '吃饭', '晴天', '轻松', '清零', '好看'],
    [8, '周日', '逛街', '晴天', '轻松', '平缓', '好看'],
    [9, '周日', '逛街', '阴天', '较重', '平缓', '好看'],
    [11, '周间', '学习', '雨天', '繁重', '严峻', '好看'],
    [12, '周间', '吃饭', '晴天', '繁重', '严峻', '难看'],
    [13, '周六', '逛街', '晴天', '较重', '清零', '好看'],
]

y = ['是', '是', '是', '是', '是', '否', '否', '否', '否', '否']
y_test = ['是', '是', '是',  '否', '否', '否', '否']


clf = tree.DecisionTreeClassifier()

clf = clf.fit(X, y)

tree.plot_tree(clf)
