#!/usr/bin/python

# 色泽 (约会时间)：青绿 (周六)、乌黑 (周日)、浅白 (工作日)

# 触感 (当天电视)：硬滑 (好看)、软粘 (不好看)

X = [[1, '周六', '吃饭', '晴天', '轻松', '清零', '好看'],
     [2, '周日', '吃饭', '阴天', '轻松', '清零', '好看'],
     [3, '周日', '吃饭', '晴天', '轻松', '清零', '好看'],
     [4, '周六', '吃饭', '阴天', '轻松', '清零', '好看'],
     [5, '工作日', '吃饭', '晴天', '轻松', '清零', '好看'],
     [6, '周六', '逛街', '晴天', '轻松', '平缓', '不好看'],
     [7, '周日', '逛街', '晴天', '繁重', '平缓', '不好看'],
     [8, '周日', '逛街', '晴天', '轻松', '平缓', '好看'],
     [9, '周日', '逛街', '阴天', '繁重', '平缓', '好看'],
     [10, '周六', '学习', '雨天', '轻松', '严峻', '不好看'],
     [11, '工作日', '学习', '雨天', '备考', '严峻', '好看'],
     [12, '工作日', '吃饭', '晴天', '备考', '严峻', '不好看'],
     [13, '周六', '逛街', '晴天', '繁重', '清零', '好看'],
     [14, '工作日', '逛街', '阴天', '繁重', '清零', '好看'],
     [15, '周日', '逛街', '晴天', '轻松', '平缓', '不好看'],
     [16, '工作日', '吃饭', '晴天', '备考', '严峻', '好看'],
     [17, '周六', '吃饭', '阴天', '繁重', '平缓', '好看'],
     ]
y = ['是', '是', '是', '是', '是', '是', '是', '是', '否', '否', '否', '否', '否', '否', '否', '否', '否']

print(X)
