#!/usr/bin/python

from sklearn import tree
from sklearn.preprocessing import LabelBinarizer, OneHotEncoder

X = [
    [1, '周六', '吃饭', '晴天', '轻松', '清零', '精彩'],
    [2, '周日', '吃饭', '阴天', '轻松', '清零', '精彩'],
    [3, '周日', '吃饭', '晴天', '轻松', '清零', '精彩'],
    [6, '周六', '逛街', '晴天', '轻松', '平缓', '无聊'],
    [7, '周日', '逛街', '晴天', '正常', '平缓', '无聊'],
    [10, '周六', '学习', '雨天', '轻松', '严峻', '无聊'],
    [14, '周间', '逛街', '阴天', '正常', '清零', '精彩'],
    [15, '周日', '逛街', '晴天', '轻松', '平缓', '无聊'],
    [16, '周间', '吃饭', '晴天', '繁重', '严峻', '精彩'],
    [17, '周六', '吃饭', '阴天', '正常', '平缓', '精彩'],
]

X_tset = [
    [4, '周六', '吃饭', '阴天', '轻松', '清零', '精彩'],
    [5, '周间', '吃饭', '晴天', '轻松', '清零', '精彩'],
    [8, '周日', '逛街', '晴天', '轻松', '平缓', '精彩'],
    [9, '周日', '逛街', '阴天', '正常', '平缓', '精彩'],
    [11, '周间', '学习', '雨天', '繁重', '严峻', '精彩'],
    [12, '周间', '吃饭', '晴天', '繁重', '严峻', '无聊'],
    [13, '周六', '逛街', '晴天', '正常', '清零', '精彩'],
]

y = ['是', '是', '是', '是', '是', '否', '否', '否', '否', '否']
y_test = ['是', '是', '是',  '否', '否', '否', '否']

enc = OneHotEncoder()
X = enc.fit_transform(X).toarray()
y = LabelBinarizer().fit_transform(y).squeeze()

print(X, y)

clf = tree.DecisionTreeClassifier()

clf = clf.fit(X, y)

tree.plot_tree(clf)
